Catalogs/Счетчики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Счетчики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСчетчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентТрансформации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МежповерочныйИнтервал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ввод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВводыЭлектроснабжения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Счетчики/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;
	// Пересчёт следующей поверки - только если изменились исходные поля,
	// чтобы не затирать значения при восстановлении документами
	Если ЗначениеЗаполнено(ДатаПоверки) И МежповерочныйИнтервал > 0 Тогда
		Если ЭтоНовый() Или ДатаПоверки <> Ссылка.ДатаПоверки
			Или МежповерочныйИнтервал <> Ссылка.МежповерочныйИнтервал Тогда
			ДатаСледующейПоверки = ДобавитьМесяц(ДатаПоверки, МежповерочныйИнтервал);	  
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
